Autodesk.Revit.DB.WorksharingDisplaySettings.RestoreUsers(System.Collections.Generic.ICollection`1{System.String})
Adds users back to the list of displayed users and permits customization of the graphics.
Any usernames that are not currently removed will be ignored.
Returns the number of users who were actually restored.
Remarks:
This is the opposite of removing users.
Note that the user will be shown with default graphic overrides - any customizations that
existed prior to removing the user will not be restored.
usersToRestore:
The usernames of the users to restore.  Any usernames that are not currently removed will
be ignored.
Returns:
The number of usernames that were actually restored.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.WorksharingDisplaySettings.RemoveUsers(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection`1{System.String},System.Collections.Generic.ICollection`1{System.String}@)
Removes users from the list of displayed users and permanently discards any customization of the graphics.
Note that a user cannot be removed if he or she owns any elements.
Remarks:
Note that default graphic overrides will be applied to any elements owned by these
users if they take ownership of any elements or worksets while they are removed.
Note also that the list of removed users will be shared by all users of the central model and
will remove all customizations by all users.
document:
The document containing this.
usersToRemove:
The usernames of the users to remove.
usersActuallyRemoved:
The users that were successfully removed.  Note that you cannot remove
users who currently own any elements.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012